Revit 2027 API
NavisworksExportOptions.ConvertElementProperties Property
 True to convert element properties, false otherwise. Default value is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ConvertElementProperties { get; set; }
Public Property ConvertElementProperties As Boolean
	Get
	Set
public:
property bool ConvertElementProperties {
	bool get ();
	void set (bool value);
}
member ConvertElementProperties : bool with get, set
Property Value
Boolean
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace